'use strict';

//var MAP_BUFFER_TIME = 10;


/**
 * @ngdoc service
 * @name projectVApp.voteInfoService
 * @description
 * # voteInfoService
 * Service in the projectVApp.
 */
angular.module('projectVApp')
  .service('addparserservice', function addparserservice($q, $http) {
    this.MAP_BUFFER_TIME = 10;
   
    Parse.initialize(
      "QDCw1Ntq4E9PmPpcuwKbO2H0B1H0y77Vj1ScO9Zx",
      "6jaJvf46pYub6Ej9IjhhIXNtZjTqRY0P4IqAJFhH"
    );

    var my_this = this;

    var afterCountParse = Parse.Object.extend("afterCount");
    var countyAry = {
      'TPE-4':[ 
      ["內湖區大湖里",4260],
      ["內湖區五分里",7918],
      ["內湖區內湖里",4841],
      ["內湖區內溝里",3702],
      ["內湖區石潭里",2249],
      ["內湖區安泰里",4215],
      ["內湖區安湖里",5951],
      ["內湖區行善里",5318],
      ["內湖區西安里",5427],
      ["內湖區西康里",7323],
      ["內湖區西湖里",6329],
      ["內湖區秀湖里",5059],
      ["內湖區明湖里",3810],
      ["內湖區東湖里",6562],
      ["內湖區金湖里",6860],
      ["內湖區金瑞里",5416],
      ["內湖區金龍里",4535],
      ["內湖區南湖里",3779],
      ["內湖區康寧里",6450],
      ["內湖區清白里",6325],
      ["內湖區港都里",4273],
      ["內湖區港富里",7560],
      ["內湖區港華里",6981],
      ["內湖區港墘里",4761],
      ["內湖區湖元里",4380],
      ["內湖區湖興里",6698],
      ["內湖區湖濱里",6583],
      ["內湖區紫星里",6514],
      ["內湖區紫陽里",6368],
      ["內湖區紫雲里",4675],
      ["內湖區週美里",5267],
      ["內湖區瑞光里",3811],
      ["內湖區瑞陽里",6483],
      ["內湖區葫洲里",5217],
      ["內湖區碧山里",5644],
      ["內湖區樂康里",6569],
      ["內湖區麗山里",4489],
      ["內湖區寶湖里",5381],
      ["內湖區蘆洲里",975 ],
      ["南港區九如里",5079],
      ["南港區三重里",3539],
      ["南港區中南里",3231],
      ["南港區中研里",7292],
      ["南港區仁福里",4502],
      ["南港區玉成里",4039],
      ["南港區合成里",5764],
      ["南港區成福里",5359],
      ["南港區百福里",4226],
      ["南港區西新里",3893],
      ["南港區東明里",4212],
      ["南港區東新里",5496],
      ["南港區南港里",5123],
      ["南港區重陽里",3575],
      ["南港區新光里",3110],
      ["南港區新富里",3243],
      ["南港區萬福里",3473],
      ["南港區聯成里",4244],
      ["南港區鴻福里",3832],
      ["南港區舊莊里",7337],
      ],

      'TPQ-6':[ 
      ["板橋區中正里",3860],
      ["板橋區仁翠里",2613],
      ["板橋區介壽里",2597],
      ["板橋區公館里",3252],
      ["板橋區文化里",2618],
      ["板橋區文聖里",3251],
      ["板橋區文翠里",3477],
      ["板橋區文德里",2604],
      ["板橋區民安里",1739],
      ["板橋區民權里",2363],
      ["板橋區永安里",2825],
      ["板橋區光華里",2352],
      ["板橋區光榮里",2207],
      ["板橋區吉翠里",3184],
      ["板橋區江翠里",4155],
      ["板橋區百壽里",2065],
      ["板橋區自立里",2428],
      ["板橋區自強里",4566],
      ["板橋區宏翠里",4036],
      ["板橋區赤松里",620 ],
      ["板橋區幸福里",3419],
      ["板橋區忠誠里",3371],
      ["板橋區忠翠里",7821],
      ["板橋區明翠里",4264],
      ["板橋區松柏里",1805],
      ["板橋區松翠里",3039],
      ["板橋區社後里",7290],
      ["板橋區金華里",3424],
      ["板橋區青翠里",2571],
      ["板橋區建國里",3134],
      ["板橋區柏翠里",3319],
      ["板橋區流芳里",1217],
      ["板橋區香社里",3649],
      ["板橋區香雅里",2284],
      ["板橋區挹秀里",1468],
      ["板橋區留侯里",1325],
      ["板橋區純翠里",4534],
      ["板橋區國光里",3256],
      ["板橋區埤墘里",3406],
      ["板橋區莊敬里",3233],
      ["板橋區莒光里",2561],
      ["板橋區嵐翠里",2188],
      ["板橋區朝陽里",3008],
      ["板橋區港尾里",2270],
      ["板橋區港嘴里",5225],
      ["板橋區港德里",4130],
      ["板橋區湳興里",4536],
      ["板橋區華江里",5071],
      ["板橋區華翠里",3071],
      ["板橋區陽明里",2495],
      ["板橋區黃石里",981 ],
      ["板橋區新民里",3637],
      ["板橋區新生里",3769],
      ["板橋區新埔里",1949],
      ["板橋區新海里",3169],
      ["板橋區新翠里",6587],
      ["板橋區新興里",2717],
      ["板橋區溪頭里",5045],
      ["板橋區滿翠里",2654],
      ["板橋區漢生里",3747],
      ["板橋區福翠里",1292],
      ["板橋區德翠里",5532],
      ["板橋區龍翠里",4304],
      ["板橋區聯翠里",3166],
      ["板橋區懷翠里",5149],
      ],

      'TPQ-1':[ 
      ["八里區下罟里",1159],
      ["八里區大崁里",2075],
      ["八里區米倉里",2554],
      ["八里區長坑里",1299],
      ["八里區荖阡里",1461],
      ["八里區訊塘里",3227],
      ["八里區埤頭里",2884],
      ["八里區頂罟里",1523],
      ["八里區龍源里",5344],
      ["八里區舊城里",5306],
      ["三芝區八賢里",336 ],
      ["三芝區古庄里",906 ],
      ["三芝區店子里",603 ],
      ["三芝區後厝里",1802],
      ["三芝區茂長里",528 ],
      ["三芝區埔坪里",5514],
      ["三芝區埔頭里",4027],
      ["三芝區圓山里",535 ],
      ["三芝區新庄里",818 ],
      ["三芝區福德里",692 ],
      ["三芝區橫山里",535 ],
      ["三芝區興華里",1118],
      ["三芝區錫板里",722 ],
      ["石門區山溪里",836 ],
      ["石門區石門里",1427],
      ["石門區尖鹿里",1447],
      ["石門區老梅里",2035],
      ["石門區茂林里",622 ],
      ["石門區草里里",887 ],
      ["石門區乾華里",359 ],
      ["石門區富基里",1266],
      ["石門區德茂里",1061],
      ["林口區下福里",1024],
      ["林口區中湖里",2713],
      ["林口區仁愛里",4560],
      ["林口區太平里",1202],
      ["林口區西林里",5960],
      ["林口區東林里",3511],
      ["林口區東勢里",4702],
      ["林口區林口里",3911],
      ["林口區南勢里",8289],
      ["林口區頂福里",966 ],
      ["林口區湖北里",1269],
      ["林口區湖南里",9269],
      ["林口區菁湖里",3568],
      ["林口區瑞平里",657 ],
      ["林口區嘉寶里",784 ],
      ["林口區麗林里",5738],
      ["林口區麗園里",3237],
      ["泰山區大科里",800 ],
      ["泰山區山腳里",5341],
      ["泰山區全興里",6298],
      ["泰山區同榮里",3369],
      ["泰山區同興里",2905],
      ["泰山區明志里",3158],
      ["泰山區泰友里",1913],
      ["泰山區貴子里",3214],
      ["泰山區貴和里",4080],
      ["泰山區貴賢里",3078],
      ["泰山區新明里",2803],
      ["泰山區楓樹里",3312],
      ["泰山區義仁里",5567],
      ["泰山區義學里",3532],
      ["泰山區福泰里",2375],
      ["泰山區福興里",2902],
      ["泰山區黎明里",2733],
      ["淡水區八勢里",3901],
      ["淡水區大庄里",3799],
      ["淡水區中和里",555 ],
      ["淡水區中興里",3594],
      ["淡水區屯山里",959 ],
      ["淡水區文化里",1565],
      ["淡水區水源里",1988],
      ["淡水區水碓里",4679],
      ["淡水區北投里",4901],
      ["淡水區北新里",2133],
      ["淡水區正德里",3289],
      ["淡水區民生里",5603],
      ["淡水區民安里",710 ],
      ["淡水區民權里",3282],
      ["淡水區永吉里",811 ],
      ["淡水區竹圍里",5178],
      ["淡水區沙崙里",2753],
      ["淡水區協元里",1369],
      ["淡水區坪頂里",1202],
      ["淡水區幸福里",3614],
      ["淡水區忠山里",806 ],
      ["淡水區忠寮里",1051],
      ["淡水區油車里",4449],
      ["淡水區長庚里",1381],
      ["淡水區竿蓁里",6798],
      ["淡水區崁頂里",2524],
      ["淡水區草東里",732 ],
      ["淡水區埤島里",1027],
      ["淡水區清文里",1068],
      ["淡水區新民里",3787],
      ["淡水區新生里",949 ],
      ["淡水區新春里",5126],
      ["淡水區新義里",3529],
      ["淡水區新興里",4850],
      ["淡水區義山里",2233],
      ["淡水區福德里",5423],
      ["淡水區賢孝里",1368],
      ["淡水區鄧公里",4943],
      ["淡水區學府里",3370],
      ["淡水區樹興里",1005],
      ["淡水區興仁里",1407],
      ["淡水區蕃薯里",862 ],
      ],
    };

    var save_array = [];

    this.run = function(){
      for(var county in countyAry){
        for(var i=0; i< countyAry[county].length; i++){
          save_array.push({
            town:countyAry[county][i][0].substr(0,3),
            village:countyAry[county][i][0].substr(3,6),
            count:0,
            maxCount:countyAry[county][i][1],
            county:county
          });
        }
      }
      console.log('length',save_array.length);
      //my_this.saveAfterCountParse(save_array, my_this.saveAfterCountParse);
    };
    
    this.saveAfterCountParse = function(data_ary, cb){
      if(!data_ary[0]){
        return;
      }
      console.log("send",JSON.stringify(data_ary[0]));

      var czparse = new afterCountParse();
      czparse
        .save(data_ary[0])
        .then(function(object) {
          cb(data_ary.splice(1),cb);
        });
    };

  });
